{
  "navbar": {
    "home": "Home",
    "about": "About",
    "blog": "Blog",
    "english": "Inglés",
    "spanish": "Español"
  },
  "home": {
    "title": "software developer.",
    "subtitle": "react, react native, ",
    "welcome_text": "Desarrollador fullstack de rápido aprendizaje, orientado a entregar el mejor resultado.",
    "learn_more": "Más acerca de mí",
    "about": "Acerca de",
    "me": "mí,",
    "blog": "Blog",
    "recent_posts": "Posts recientes"
  },
  "about": {
    "about": "Acerca de",
    "me": "mí,",
    "about_description": "Una buena carrera y vida, según creo yo, es una en la que voluntariamente enfrentás responsabilidades más grandes cada día. Me considero una persona proactiva, con una curiosidad incesante, y siempre dispuesto a resolver nuevos desafíos. Busco ser parte de un proyecto valioso y desarrollarme en la industria. ",
    "technologies": "Tecnologías",
    "react": "Desarrollé interfaces de usuario utilizando ReactJs y React Native, aplicando técnicas modernas de manejo de estado (Redux, Context), integración de APIs, autenticación y testing (React-Testing-Library). También estoy familiarizado con NextJs para crear apliaciones React con pre-fetching y server-side rendering.",
    "javascript": "Mediante cursos y proyectos, me he estado familiarizando con el lenguaje con una profundidad cada vez mayor. Ya habiendo aprendido los mejores estándares y prácticas en cuanto a calidad de código (principios SOLID) además de los paradigmas OOP y funcional, sigo aprendiendo conceptos avanzados (como closures, prototipos, el motor de javascript, etc.)  ",
    "nodejs": "Desarrollé APIs para aplicaciones end-to-end con ExpressJs utilizando Mongodb para bases de datos (mongoose), y passportjs para autenticación de requests y sesiones (strategies local y externas). También implementé las SDK de Sendgrid, Firebase, MercadoPago (Checkout Pro) y AWS (para almacenamiento de imágenes en S3), entre otras.",
    "my_journey": "Mi camino",
    "my_journey_paragraphs": [
      "Desde una edad temprana, siempre me interesó la practicalidad de las UIs de software, y tuve curiosidad por la programación. Como hobby, empecé a aprender desarrollo web en 2020.",
      "Aprendí React y Node tomando cursos online y aplicando el conocimiento en proyectos personales. Más adelante en 2021, desarrollé mi primer aplicación con React Native, y logré una facilidad para explorar y aprender nuevas nuevas librerías y tecnologías leyendo documentación.",
      "Al inicio de 2022, escuché acerca de Alkemy.org, un programa de aceleración que ofrece apprenticeship a trainees. Determinado a dar el salto y convertirme en un desarrollador profesional, envié el challenge de admisión y fui aceptado.",
      "Alkemy fue una experiencia muy valiosa. Bajo el liderazgo y mentoreo de un ingeniero senior de MercadoLibre, mi equipo y yo contruimos una UI moderna para una ONG. Trabajando en un entorno de equipo realista, aprendí a trabajar con methdologías ágiles, su workflow y sus herramientas. Durante este proceso, disfruté ayudar a mis compañeros y me vi a mí mismo como un jugador de equipo. Por otro lado, al tener mi código revisado por un desarrollador experimentado, pude mejorar significativamente la calidad de mi código."
    ],
    "my_skills": "Habilidades"
  },
  "blogs": {}
}
